{
  "healthy": {
    "description": "Healthy tomato leaf used for classification or baseline comparison.",
    "cause": "Optimal growing conditions, proper care, and absence of pathogens.",
    "remedies": "Maintain good agricultural practices, proper watering, balanced fertilization, and pest management."
  },
  "bacterial spot": {
    "description": "Water-soaked to dark brown/black spots on leaves, often coalescing; raised, scab-like lesions on fruit.",
    "cause": "Xanthomonas spp. bacteria.",
    "remedies": "Use pathogen-free seeds/transplants, sanitize tools, crop rotation, avoid wet foliage, preventative fungicides."
  },
  "early blight": {
    "description": "Circular, dark brown/black spots with concentric rings ('Bull's eye') on leaves; leads to defoliation.",
    "cause": "Alternaria solani fungus.",
    "remedies": "Crop rotation, good air circulation, remove debris, resistant varieties, fungicides."
  },
  "late blight": {
    "description": "Rapidly enlarging purplish-black lesions with cottony white mold on leaves/stems; firm, brown lesions on fruit.",
    "cause": "Phytophthora infestans oomycete.",
    "remedies": "Remove volunteers, avoid overhead irrigation, preventative fungicides, destroy affected plants, crop rotation."
  },
  "leaf mold": {
    "description": "Light green/yellow spots on upper leaves; olive-green/gray velvety fungal growth on undersides; may cause fruit rot.",
    "cause": "Passalora fulva fungus.",
    "remedies": "Resistant varieties, increase air circulation, avoid overhead watering, remove diseased parts, fungicides."
  },
  "mosaic virus": {
    "description": "Mottled yellow/light green leaves, often distorted; stunted growth, poor fruit set.",
    "cause": "Tomato Mosaic Virus (ToMV), transmitted by contact and infected seeds.",
    "remedies": "Resistant varieties, healthy seeds, remove diseased plants, disinfect tools, weed control."
  },
  "septoria spot": {
    "description": "Small circular spots with dark margins and tan centers, tiny black dots (pycnidia); leaves yellow and wither.",
    "cause": "Septoria lycopersici fungus.",
    "remedies": "Remove infected leaves, improve air circulation, mulch, avoid overhead watering, crop rotation, fungicides."
  },
  "yellow leaf curl": {
    "description": "Small, yellowing leaves curling upwards; stunted bushy growth; reduced fruit production.",
    "cause": "Tomato yellow leaf curl virus (TYLCV), transmitted by whiteflies.",
    "remedies": "Resistant varieties, whitefly control (insecticides/biological), remove infected plants, weed control."
  }
}